{
  "about0":"Passionate about providing alternatives for dispute resolution, Tadgh Horgan offers mediation and other conflict resolution services.",
  "about1":"Since qualifying as a mediator in 2009, Tadgh has worked with many professionals who share his belief that Mediation can play a crucial part in resolving disputes amicably. As a member of the Mediators' Institute of Ireland, and an Honours Law Degree graduate from University College Cork, Tadgh is well placed to appreciate the positive role that mediation can play, as an alternative to direct litigation.",
  "about2":"Having managed a large nationwide company for many years, Tadgh believes that the success of any organisation depends upon engaging with complex interpersonal workplace disputes in a timely and independent manner. Enabling and facilitating difficult conversations between parties in dispute, through an independent professional Mediator, can be empowering for all parties and more cost-effective for the organisation.",
  "about3":"Tadgh has also worked at senior levels in the voluntary and community sector. He brings considerable professional and personal experience to resolving issues in diverse commercial and community settings. By opting for mediation, parties can resolve disputes quickly and constructively, ensuring a fair process where all voices are heard. Rather than resorting to a judgement imposed by a court, the Mediator can assist parties in developing their own lasting solutions, allowing them to maintain amicable relationships thereafter.",
  "fam0":"The breakdown of relationships is traumatic for everyone involved, especially children.",
  "fam1":"Family Mediation helps people find personalized solutions that work for them and their children. It provides a safe space to voice concerns without the constraints of a court, which can often prolong conflict.",
  "fam2":"Maintaining control over a solution, within an already strained relationship, is more sustainable and increases the likelihood of fostering a more harmonious relationship in the future.",
  "fam3":"While the Mediator is not a relationship therapist or legal adviser, they can assist with formulating a parenting plan that helps all parties.",
  "fam4":"During Mediation, differences are openly discussed and options thoroughly explored to ensure a fair and lasting solution. We enable both parties to move forward and rebuild their lives."
}